Revit 2027 API
BuiltInFailures.EnergyAnalysisUtilitiesDBFailures Class
 Failures about EnergyAnalysisUtilitiesDBFailures.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisUtilitiesDBFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class EnergyAnalysisUtilitiesDBFailures
Public NotInheritable Class EnergyAnalysisUtilitiesDBFailures
public ref class EnergyAnalysisUtilitiesDBFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type EnergyAnalysisUtilitiesDBFailures = class end
The BuiltInFailures.EnergyAnalysisUtilitiesDBFailures type exposes the following members.
Properties
Name | Description
AimErrEmptyName |  MassZone '%1' has empty name and id values which cannot be used as gbXML identifiers.
Top
See Also
Reference
Autodesk.Revit.DB Namespace